<template>
  <div class="note-wrapper">
    <h1>帮助：游戏设计</h1>
    <hr>
    <br>
    <p>目前提供使用者进行设计的是一款冒险游戏，类似超级马里奥。</p>
    <p>玩家通过避开所有的怪物与熔浆，收集关卡上所有金币，方能通关。</p>
    <br>
    <p>游戏设计包括三个部分</p>
    <p>1. 关卡背景设计</p>
    <p>2. 角色属性设计</p>
    <p>3. 关卡结构设计</p>
    <br>
    <br>
    <br>
    <br>
    <h2>1. 进入游戏设计界面</h2>
    <br>
    <p>
      <img src="@/pic/helpPage/selectGameDesign.png">
    </p>
    <br>
    <ul>
      <li>
        在总控制面板中，点击
        <u>游戏设计</u> ，即可进入游戏设计面板。
      </li>
    </ul>
    <br>
    <p>
      <img src="@/pic/helpPage/gameDesignPanelIntro.png">
    </p>
    <p>①关卡列表，红色背景的方块表示当前选择的关卡，白色代表其他已添加的关卡。</p>
    <p>②关卡添加按钮，添加新的关卡。</p>
    <p>③完成按钮，返回设计总台。</p>
    <p>④背景设计选项，设计当前关卡的背景。</p>
    <p>⑤角色属性选项，设置角色属性。</p>
    <p>⑥结构设计按钮，进入关卡的结构设计界面。</p>
    <p>⑦游戏预览，实时反应当前关卡设计效果。</p>
    <br>
    <br>
    <br>
    <br>
    <h2>2. 添加与切换关卡</h2>
    <br>
    <ul>
      <li>
        点击
        <u>②关卡添加按钮</u> ，即可添加新的关卡。
      </li>
      <li>&nbsp;点击相应的关卡块，即可切换到对应的关卡上。</li>
    </ul>
    <br>
    <br>
    <br>
    <br>
    <h2>3. 关卡背景设计</h2>
    <br>
    <ul>
      <li>
        点击
        <u>④背景设计选项</u> 进行背景设计。
      </li>
      <li>&nbsp;每个关卡都可以设计各自的背景，有两种可供选择的方案：</li>
    </ul>
    <p>1. 纯背景色</p>
    <p>2. 图片背景</p>
    <br>
    <br>
    <br>
    <br>
    <h2>4. 角色属性设计</h2>
    <br>
    <ul>
      <li>
        点击
        <u>⑤角色属性选项</u> 开始设计。
      </li>
      <li>&nbsp;角色属性目前提供了4个选项：</li>
    </ul>
    <p>角色生命：游戏角色的生命数</p>
    <p>角色速度：游戏角色的行驶速度</p>
    <p>角色弹跳：游戏角色的弹跳高度</p>
    <p>角色大小：游戏角色的体型大小</p>
    <p>
      💡：
      <i>不同的关卡，角色属性都是统一的，因此只需设置一次。</i>
    </p>
    <br>
    <br>
    <br>
    <br>
    <h2>5. 关卡结构设计</h2>
    <br>
    <ul>
      <li>点击结构设计按钮，即进入当前关卡的结构设计面板。</li>
    </ul>
    <p>
      <img src="@/pic/helpPage/structureDesignPanelIntro.png">
    </p>
    <br>
    <p>①操作台，手动添加元素的地方。</p>
    <p>②当前选择元素框，如当前有选择的元素，则显示当前选择的元素，表明是添加模式。如果当前没有选择的元素，则图案为空，表明是删除模式。</p>
    <p>③游戏元素选择区域。</p>
    <p>④放大缩小功能，根据需要放大缩小操作台。</p>
    <p>⑤调整关卡结构的长与宽，1代表一个方格。</p>
    <p>⑥是否显示操作台的网格线。</p>
    <p>⑦撤销上一操作。</p>
    <p>⑧重置当前级别。</p>
    <p>⑨清空所有已添加的元素。</p>
    <p>⑩点击后显示下拉菜单，提供6种游戏级别的模版选择。</p>
    <p>⑪取消并返回游戏设计界面。</p>
    <p>⑫完成按钮，保存并返回游戏设计界面。</p>
    <p>💡：点击每个方块的红色背景标题可以隐藏对应部分的设置。</p>
    <br>
    <br>
    <h3>5.1 游戏元素介绍</h3>
    <p>玩家：操控的游戏角色，有且只能有一个。</p>
    <p>墙体：障碍物，玩家不能通过的实体。</p>
    <p>怪物：会移动且能够追踪玩家的怪物。</p>
    <p>金币：需要被收集的物品，全部收集完成，才能通关。</p>
    <p>熔浆：不同的熔浆有不同的移动方式，不会追踪玩家，玩家碰到会死亡。</p>
    <br>
    <br>
    <h3>5.2 添加与删除元素</h3>
    <br>
    <ul>
      <li>
        在
        <u>③游戏元素选择区域</u> 中选择相应的元素，然后在
        <u>①操作台</u> 中点击方格，被选择的元素就会在对应的方格中添加。
      </li>
      <li>
        点击
        <u>②当前选择元素框</u> 取消元素选择。
      </li>
      <li>
        <u>&nbsp;②当前选择元素框</u> 为空时，属于删除模式，此时点击
        <u>①操作台</u> 中的方格会删除对应方格中已经添加的元素。
      </li>
    </ul>
    <p>
      💡：在
      <u>①操作台</u> 中长按并拖动鼠标可以批量添加或删除元素。
    </p>
    <br>
    <br>
    <h3>5.3 增加游戏长度</h3>
    <br>
    <ul>
      <li>
        在
        <u>⑤</u> 中的长与宽输入不同的数字，能够分别改变游戏结构的长与宽，
      </li>
    </ul>
    <br>
    <br>
    <h3>5.4 返回游戏设计界面</h3>
    <br>
    <ul>
      <li>
        点击
        <u>⑪取消设计</u> ，在不保存当前结构设计的情况下，返回游戏设计界面。
      </li>
      <li>
        点击
        <u>⑫完成按钮</u> ，保存当前设计，返回游戏设计界面。
      </li>
    </ul>
    <p>💡：如果找不到保存和取消按钮，可能是隐藏在页面的下方，通过拉长浏览器或隐藏部分设置即可找到。</p>
    <br>
    <br>
    <br>
    <br>
    <h2>6. 完成并测试</h2>
    <br>
    <ul>
      <li>在游戏设计界面中点击完成按钮，返回设计总台，就能测试整个游戏的设计成果。</li>
    </ul>
    <p>
      <img src="@/pic/helpPage/gameDesignResult.png">
    </p>
  </div>
</template>

<script>
export default {
  name: "helpForGameDesign"
};
</script>

<style lang="scss" scoped>
@import "./lib/_cssStyle.scss";
.note-wrapper {
  text-align: left;
  h1 {
    font-size: 50px;
  }
  @media screen and(max-width: 500px) {
    h1 {
      font-size: 40px;
    }
  }
}
</style>
